app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)
    # @article.published_date = params[:article][:status] == "publish" ? Date.current : nil
    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "user_id", "published_date", "status", "created_at", "updated_at", "slug") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    # @article.published_date = params[:article][:status] == "publish" ? Date.current : nil
    respond_to do |format|
      if @article.update(article_params)
---
UPDATE "articles" SET "updated_at" = ? WHERE "articles"."id" = ?  [["updated_at", "2022-08-15 08:11:07.653309"], ["id", 6]]