app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @comment.user_id = current_user.id

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("body", "user_id", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "first comment"], ["user_id", 2], ["article_id", 1], ["created_at", "2022-08-15 14:01:47.972576"], ["updated_at", "2022-08-15 14:01:47.972576"]]