app/controllers/home_controller.rb

SELECT "articles".* FROM "articles" WHERE (status = 0) ORDER BY "articles"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles" WHERE (status = 0)
---
  def find_articles
    @pagy, @articles = pagy(Article.published.order(created_at: :desc), page:params[:page], items: 10 )