app/controllers/likes_controller.rb

  def create
    @like = Like.new(like_params)
    @like.user = current_user

    respond_to do |format|
      if @like.save
---
INSERT INTO "likes" ("article_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["article_id", 1], ["user_id", 2], ["created_at", "2022-08-16 05:11:52.913168"], ["updated_at", "2022-08-16 05:11:52.913168"]]

  def destroy
    @like.destroy
---
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]

    def set_like
      @like = Like.find(params[:id])
---
SELECT "likes".* FROM "likes" WHERE "likes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]